schedule = {
    'Monday': [('2', 'Матанализ', '34-10', 'лекция'),
               ('3', 'Аналит. геометрия', '34-14', 'практика'),
               ('4', 'Аналит. геометрия', '34-10', 'лекция')],
    'Tuesday': [('2', 'История', '34-01', 'практика'),],
    'Wednesday': [('1', 'Матанализ', '34-10', 'лекция'),
                  ('2', 'Матанализ', '34-14', 'практика'),
                  ('3', 'Алгебра', '34-14', 'практика')],
    'Thursday': [('1','Введение в специальность', '22-02', 'лекция'),
                 ('2','Алгебра', '34-10', 'лекция'),
                 ('3','Матанализ', '34-14', 'практика')],
    'Friday': [('2', 'Программирование', '34-06', 'практика'),
               ('3', 'ОРГ', '34-02', 'практика'),
               ('4','Основы анализа', '34-15', 'практика')],
}
schedule_A = {
    'Tuesday': [('4','Программирование (а)', '34-02', 'практика'), ],
}
schedule_B = {
    'Friday': [('1','Программирование (б)', '34-06', 'практика'), ],
}
schedule_one_week ={
    'Monday': [('1', 'Программирование', '22-04', 'семинар'),],
    'Tuesday': [('1', 'История', '42-29', 'лекция'),]

}
schedule_two_week ={
    'Monday': [('5', 'Профилирующие курсы', '22-02', 'лекция'),],
    'Tuesday': [('1', 'ОРГ', '42-29', 'лекция'),]
}
schedule_time = {
    '1': ['08:30','10:05'],
    '2': ['10:15','11:50'],
    '3': ['12:00','13:35'],
    '4': ['14:10','15:45'],
    '5': ['15:55','17:30'],
    '6': ['17:40','19:15'],
}